{
  "English": {
    "text": "The quick brown fox jumps over the lazy dog. This sentence contains all letters of the English alphabet, making it perfect for typing practice. Advanced learners should focus on complex grammar structures and vocabulary building. Reading comprehension improves with consistent daily practice. Understanding context clues helps deduce meanings of unfamiliar words. Academic writing requires formal tone and precise word choices. Mastering English takes dedication and persistent effort over time."
  },
  "French": {
    "text": "Bonjour, je m'appelle Pierre. J'ai vingt ans et j'habite à Paris. J'aime lire des livres et écouter de la musique. Le français est une langue magnifique. Pour commencer à apprendre, il faut pratiquer tous les jours. Les bases de la grammaire sont importantes. Avec du temps et de la patience, on peut devenir fluent. La culture française est très riche et intéressante."
  },
  "German": {
    "text": "Hallo, ich heiße Anna. Ich bin zwanzig Jahre alt und wohne in Berlin. Ich liebe Bücher lesen und Musik hören. Deutsch ist eine schöne Sprache mit vielen Regeln. Zum Anfangen muss man jeden Tag üben. Grundlagen der Grammatik sind sehr wichtig. Mit Zeit und Geduld kann man fließend werden. Die deutsche Kultur ist sehr reich und interessant."
  },
  "Spanish": {
    "text": "Hola, me llamo Carlos. Tengo veinte años y vivo en Madrid. Me gusta leer libros y escuchar música. El español es un idioma hermoso y expresivo. Para empezar hay que practicar todos los días. Las bases de la gramática son fundamentales. Con tiempo y paciencia se puede lograr fluidez. La cultura hispana es rica e interesante."
  },
  "Swedish": {
    "text": "Hej, jag heter Erik. Jag är tjugo år gammal och bor i Stockholm. Jag gillar att läsa böcker och lyssna på musik. Svenska är ett vackert språk med intressanta regler. För att börja måste man öva varje dag. Grammatikens grunder är viktiga. Med tiden och tålamod blir man flytande. Den svenska kulturen är rik och fascinerande."
  },
  "Japanese": {
    "text": "昨日、友達と新宿へ映画を見に行きました。駅から映画館まで歩いて10分くらいかかりました。映画はとても面白かったですが、少し長かったです。映画が終わった後、近くのレストランで晩ご飯を食べました。友達は魚料理を注文して、私は肉料理を頼みました。食事をしながら、来週の旅行の計画について話し合いました。家に帰る時、電車の中で寝てしまいました。"
  },
  "Chinese": {
    "text": "昨天我和朋友一起去公园散步。天气很好，不冷也不热。我们在公园里走了半个小时，看到很多人在锻炼身体。有的在跑步，有的在打太极拳。后来我们坐在椅子上休息，一边喝水一边聊天。朋友告诉我他下个月要去上海工作。我祝他工作顺利。我们约好下周末再见面。"
  }
}
